In [1]:
import pandas as pd
import numpy as np

professions = pd.read_csv("/Users/michalroczek/Desktop/course-files/Prestige.csv")
professions.head()

                  name  education  income  women  prestige  census  type
0   gov.administrators      13.11   12351  11.16      68.8    1113  prof
1     general.managers      12.26   25879   4.02      69.1    1130  prof
2          accountants      12.77    9271  15.70      63.4    1171  prof
3  purchasing.officers      11.42    8865   9.11      56.8    1175  prof
4             chemists      14.62    8403  11.68      73.5    2111  prof

In [2]:
dict = {"name" : "data scientist", "education" : np.NaN, "income" : np.NaN, "women" : np.NaN, "prestige" : np.NaN, "census" : np.NaN, "type" : np.NaN}

In [3]:
dict

{'name': 'data scientist',
 'education': nan,
 'income': nan,
 'women': nan,
 'prestige': nan,
 'census': nan,
 'type': nan}

In [5]:
professions.append(dict, ignore_index=True)

                    name  education   income  women  prestige  census  type
0     gov.administrators      13.11  12351.0  11.16      68.8  1113.0  prof
1       general.managers      12.26  25879.0   4.02      69.1  1130.0  prof
2            accountants      12.77   9271.0  15.70      63.4  1171.0  prof
3    purchasing.officers      11.42   8865.0   9.11      56.8  1175.0  prof
4               chemists      14.62   8403.0  11.68      73.5  2111.0  prof
..                   ...        ...      ...    ...       ...     ...   ...
98          taxi.drivers       7.93   4224.0   3.59      25.1  9173.0    bc
99          longshoremen       8.37   4753.0   0.00      26.1  9313.0    bc
100          typesetters      10.00   6462.0  13.58      42.2  9511.0    bc
101          bookbinders       8.55   3617.0  70.87      35.2  9517.0    bc
102       data scientist        NaN      NaN    NaN       NaN     NaN   NaN

[103 rows x 7 columns]

In [8]:
taxi = professions[professions["name"] == 'taxi.drivers']

In [9]:
taxi

            name  education  income  women  prestige  census type
98  taxi.drivers       7.93    4224   3.59      25.1    9173   bc

In [11]:
professions.drop(98,inplace=True)

In [12]:
professions.tail(5)

                name  education  income  women  prestige  census type
96   train.engineers       8.49    8845   0.00      48.9    9131   bc
97       bus.drivers       7.58    5562   9.47      35.9    9171   bc
99      longshoremen       8.37    4753   0.00      26.1    9313   bc
100      typesetters      10.00    6462  13.58      42.2    9511   bc
101      bookbinders       8.55    3617  70.87      35.2    9517   bc

In [13]:
professions = professions.append(taxi)

In [14]:
professions.tail()

             name  education  income  women  prestige  census type
97    bus.drivers       7.58    5562   9.47      35.9    9171   bc
99   longshoremen       8.37    4753   0.00      26.1    9313   bc
100   typesetters      10.00    6462  13.58      42.2    9511   bc
101   bookbinders       8.55    3617  70.87      35.2    9517   bc
98   taxi.drivers       7.93    4224   3.59      25.1    9173   bc

In [15]:
del professions["census"]

In [16]:
professions.head()

                  name  education  income  women  prestige  type
0   gov.administrators      13.11   12351  11.16      68.8  prof
1     general.managers      12.26   25879   4.02      69.1  prof
2          accountants      12.77    9271  15.70      63.4  prof
3  purchasing.officers      11.42    8865   9.11      56.8  prof
4             chemists      14.62    8403  11.68      73.5  prof

In [17]:
professions.drop(columns="type",inplace=True)

In [18]:
professions.head()

                  name  education  income  women  prestige
0   gov.administrators      13.11   12351  11.16      68.8
1     general.managers      12.26   25879   4.02      69.1
2          accountants      12.77    9271  15.70      63.4
3  purchasing.officers      11.42    8865   9.11      56.8
4             chemists      14.62    8403  11.68      73.5